app/services/discount_service.rb

  def apply_discount(item)
    product = Product.find(item.product_id)
---
SELECT "products".* FROM "products" WHERE "products"."id" = 4 LIMIT 1