app/serializers/cart_serializer.rb

SELECT "items".* FROM "items" WHERE "items"."cart_id" = 1
SELECT "products".* FROM "products" WHERE "products"."id" = 4 LIMIT 1
---
  attributes :total_price_cents

  attribute :basket do |cart|
    cart.items.map { |item| item.product.code }.join(",")