app/blueprints/cart_blueprint.rb

  fields :total_price

  field :basket do |cart|
    cart.items.map { |item| item.product.code }.join(", ")
---
SELECT "items".* FROM "items" WHERE "items"."cart_id" = 1
SELECT "products".* FROM "products" WHERE "products"."id" = 1 LIMIT 1