backend/app/controllers/api/v1/carts_controller.rb

      def index
        carts = Cart.all
---
SELECT "carts".* FROM "carts"

      def create
        cart = Cart.create(total_price: 0)
---
INSERT INTO "carts" ("total_price_cents", "created_at", "updated_at") VALUES (0, '2025-06-22 05:48:02.270719', '2025-06-22 05:48:02.270719') RETURNING "id"

      def show
        cart = Cart.find(params[:id])
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = 1 LIMIT 1

      def add_to_basket
        cart = Cart.find(params[:id])
        product = Product.find(item_params[:product_id])
        cart.items.create!(product: product, price: product.price)
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = 1 LIMIT 1
SELECT "products".* FROM "products" WHERE "products"."id" = 1 LIMIT 1
INSERT INTO "items" ("cart_id", "product_id", "price_cents", "created_at", "updated_at") VALUES (1, 1, 311, '2025-06-22 04:41:01.969660', '2025-06-22 04:41:01.969660') RETURNING "id"